{
  "metadata": {
    "total_size": 10.296943664550781
  },
  "weight_map": {
    "vit.embeddings.cls_token": "pytorch_model-00001.bin",
    "vit.embeddings.position_embeddings": "pytorch_model-00001.bin",
    "vit.embeddings.patch_embeddings.projection.weight": "pytorch_model-00001.bin",
    "vit.embeddings.patch_embeddings.projection.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.0.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.1.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.2.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.3.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.4.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.5.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.6.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.7.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.8.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.9.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.10.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.attention.query.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.attention.query.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.attention.key.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.attention.key.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.attention.value.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.attention.value.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.attention.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.intermediate.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.intermediate.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.output.dense.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.output.dense.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.layernorm_before.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.layernorm_before.bias": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.layernorm_after.weight": "pytorch_model-00001.bin",
    "vit.encoder.layer.11.layernorm_after.bias": "pytorch_model-00001.bin",
    "vit.layernorm.weight": "pytorch_model-00001.bin",
    "vit.layernorm.bias": "pytorch_model-00001.bin",
    "classifier.weight": "pytorch_model-00001.bin",
    "classifier.bias": "pytorch_model-00001.bin"
  }
}
